In [7]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({ 'sex' : [1,2,1,3,2,1],
                  'score' : [5,4,3,4,2,6]})
df

   sex  score
0    1      5
1    2      4
2    1      3
3    3      4
4    2      2
5    1      6

In [4]:
df['sex'].value_counts().sort_index()

1    3
2    2
3    1
Name: sex, dtype: int64

In [5]:
df['score'].value_counts().sort_index()

2    1
3    1
4    2
5    1
6    1
Name: score, dtype: int64

In [8]:
# sex가 3이면 Nan 부여
df['sex'] = np.where( df['sex'] ==3, np.nan, df['sex'])
df

   sex  score
0  1.0      5
1  2.0      4
2  1.0      3
3  NaN      4
4  2.0      2
5  1.0      6

In [9]:
# score가 5보다 크면 Nan 부여
df['score'] = np.where( df['score']>5 , np.nan , df['score'])
df

   sex  score
0  1.0    5.0
1  2.0    4.0
2  1.0    3.0
3  NaN    4.0
4  2.0    2.0
5  1.0    NaN

In [10]:
# 성별에 따른 score 평균
df.dropna( subset = ['sex','score']) \
            .groupby('sex') \
            .agg( mean_score = ('score','mean'))

     mean_score
sex
1.0         4.0
2.0         3.0

In [16]:
df=pd.DataFrame( { 'x1' : [1,1,2,2]})
df['x2'] = np.where( df['x1'] ==1, 'a',np.nan)
df

   x1   x2
0   1    a
1   1    a
2   2  nan
3   2  nan

In [17]:
df.isna()

      x1     x2
0  False  False
1  False  False
2  False  False
3  False  False

In [18]:
#결측치로 만들 값에 문자 부여
df['x2'] = np.where( df['x1']==1,'a','etc')

In [22]:
#'etc'를 Nan으로 바꾸기
df['x2'] = df['x2'].replace('etc',np.nan)
df

   x1   x2
0   1    a
1   1    a
2   2  NaN
3   2  NaN

In [23]:
df.isna()

      x1     x2
0  False  False
1  False  False
2  False   True
3  False   True